large_tank/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0  0  0 )//0
    (8 0 0)//1
    (8 1.2 0)//2
    (0 1.2 0)//3
    (0 0 16)//4
    (8 0 16)//5
    (8 1.2 16)//6
    (0 1.2 16)//7
    (120 0 0)//8
    (120 1.2 0)//9
    (120 0 16)//10
    (120 1.2 16)//11                
    (128 0 0)//12
    (128 1.2 0)//13
    (128 0 16)//14
    (128 1.2 16)//15
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (40 120 100) simpleGrading (1 1 1) //inlet
    hex (1 8 9 2 5 10 11 6) (600 120 100) simpleGrading (1 1 1) //main
    hex (8 12 13 9 10 14 15 11) (40 120 100) simpleGrading (1 1 1) //backout
);

edges           
(
);

patches         
(
    patch inlet0
    (
        (0 4 7 3)
    )
    patch outlet1
    (
        (10 14 15 11)
        (12 13 15 14)
        (8 9 13 12)
    )
    wall bottom
    (
        (0 1 5 4)
        (5 1 8 10)
        (8 12 14 10)
        (5 10 11 6)
    )
    wall side 
    (
        (4 5 6 7)
        (0 3 2 1)
    )
    patch atmos
    (
        (3 7 6 2)
        (2 6 11 9)
        (9 11 15 13)
    )
    patch internalWall
    ()
);

mergePatchPairs
(
);

// ************************************************************************* //
