large_tank/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.8;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet0); // outlet1);

initializationName inlet0;

inlet0Coeffs
{
    waveType    stokesFirst;  
    depth       5.00000;
    phi         0.000000;
    period      3.0337;
    direction  (1.0 0.0 0.0);
    height      0.1;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (0 0.0 0);
        endX        (8 1.2  16);
        orientation      (1.0 0.0 0.0);
    }
};


//outlet1Coeffs
//{
//    waveType    potentialCurrent;
//    U           (0 0 0);
//    Tsoft       2;

//    relaxationZone
//    {
//        relaxationScheme Spatial;
//        relaxationShape  Rectangular;
//        beachType        Empty;    
//
//        relaxType   OUTLET;
//        startX      (120.0 0.0 0.0);
//        endX        (128.0 1.2  16);
//        orientation      (-1.0 0.0 0.0);
//    }
//};



// ************************************************************************* //
