large_tank/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    box;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (12 0 0) (15 1.2 3.0);
        }
    }
    {
        name    box;
        type    cellSet;
        action  invert;
        source  boxToCell;
        sourceInfo
        {
            box (12 0 0) (15 1.2 3.0);
        }
    }
);

// ************************************************************************* //
